[
  "The electron is a subatomic particle with a negative one elementary electric charge.",
  "Electrons exhibit properties of both particles and waves and can collide with other particles. Additionally, electrons can be diffracted like light.",
  "The wave properties of electrons are easier to observe with experiments than the wave properties of neutrons and protons. Electrons have lower mass and longer de Broglie wavelength for a given energy.",
  "Electrons play a role in physical phenomena, which include electricity, magnetism, chemistry, and thermal conductivity. Electrons participate in gravitational interactions, electromagnetic interactions, and weak interactions.",
  "An electron has charge and a surrounding electric field, and is moving relative to an observer. The observer will observe the electron to generate a magnetic field.",
  "Electrons radiate or absorb energy in the form of photons when they are accelerated.",
  "Laboratory instruments are capable of trapping individual electrons, electron plasma, and use electromagnetic fields.",
  "Special telescopes can detect electron plasma in outer space.",
  "Electrons are involved in many applications, including tribology or frictional charging, electrolysis, electrochemistry, battery technologies, electronics, welding, cathode-ray tubes, photoelectricity, photovoltaic solar panels, electron microscopes, radiation therapy, lasers, gaseous ionization detectors, and particle accelerators.",
  "Positive protons interact with negative electrons within atomic nuclei allowing composition of atoms.",
  "Ionization changes the binding energy of atomic system. Differences in proportions of negative electrons versus positive nuclei change the binding energy of atomic system.",
  "The exchange or sharing of electrons is the main cause of chemical bonding. Atoms are involved in exchange or sharing of electrons.",
  "Irish physicist George Johnstone Stoney named charge electron in 1891.",
  "The word 'electric' is derived from Latin ēlectrum, and electricity also comes from Latin ēlectrum. Latin ēlectrum originated from the Greek word ἤλεκτρον, which means amber. Latin ēlectrum is also the root of an alloy of the same name.",
  "du Fay concluded electricity consists of two electrical fluids, vitreous fluid from glass rubbed with silk and resinous fluid from amber rubbed with wool.",
  "Fluids can neutralize each other when combined.",
  "Ebenezer Kinnersley reached the same conclusion independently.",
  "Benjamin Franklin proposed the electricity concept, which is a single electrical fluid that shows excess (+) or deficit (-).",
  "He gave them modern charge, which has positive and negative.",
  "Franklin thought of charge carrier as positive, but did not correctly identify the surplus or deficit of charge carrier.",
  "Richard Laming developed the idea that is atom model, which is composed of a core of matter surrounded by subatomic particles. The subatomic particles have unit electric charges, and surround the core of matter, which is in the atom. The core of matter is surrounded by subatomic particles, which have electric charges that are unit.",
  "Wilhelm Eduard Weber theorized electricity was composed of positively and negatively charged fluids governed by inverse square law.",
  "George Johnstone Stoney studied the phenomenon of electrolysis and suggested there existed a single definite quantity of electricity, which is the charge of a monovalent ion.",
  "The electron is a combination of electric and ion.",
  "The suffix -on is used to designate subatomic particles, including proton and neutron, and is derived from electron.",
  "Johann Wilhelm Hittorf, a student of Plücker, found a solid body that is placed in between the cathode and phosphorescence. The solid body casts a shadow, which is cast upon the phosphorescent region of the tube.",
  "Hittorf inferred there are straight rays emitted from the cathode and inferred phosphorescence was caused by the rays striking the tube walls.",
  "Goldstein dubbed rays are called cathode rays.",
  "Decades of experimental and theoretical research involving cathode rays were important in J. J. Thomson's eventual discovery of electrons.",
  "He showed in 1874 that cathode rays can turn a small paddle wheel when placed in the path of the wheel.",
  "He concluded that rays carried momentum.",
  "He applied a magnetic field and was able to deflect rays, which behaved as though the beam were negatively charged.",
  "He proposed that properties could be explained by regarding cathode rays as composed of negatively charged gaseous molecules in a fourth state of matter in which the mean free path of the particles is so long that collisions may be ignored.",
  "Arthur Schuster is a physicist of German-born British origin who expanded upon experiments of Crookes, placed metal plates parallel to the cathode rays, and applied an electric potential between the plates.",
  "The field deflected rays toward the positively charged plate, providing further evidence that the rays carried a negative charge.",
  "Schuster was able to estimate the charge-to-mass ratio of ray components and measured the amount of deflection for a given electric and magnetic field in 1890.",
  "Charge carriers were assumed to be heavier hydrogen or nitrogen atoms.",
  "Schuster's estimates subsequently turn out to be largely correct.",
  "Becquerel showed beta rays emitted by radium could be deflected by an electric field, which has the same mass-to-charge ratio as cathode rays.",
  "This evidence strengthened the view that electrons existed as components of atoms.",
  "He showed negatively charged particles produced by radioactive materials, heated materials, and illuminated materials, which were universal.",
  "The term was coined by George Johnstone Stoney in 1891 as a tentative name for the basic unit of electrical charge, which has not yet been discovered.",
  "The electron's charge was measured by American physicists Robert Millikan and Harvey Fletcher, who performed the oil-drop experiment of 1909 whose results were published in 1911.",
  "The experiment used an electric field that prevented a charged droplet of oil from falling, which resulted from gravity.",
  "The device could measure electric charge and can measure ions in range of 1-150 with an error margin of less than 0.3%.",
  "Experiments had been done by Thomson's team. Thomson's team used clouds of charged water droplets, which were generated by electrolysis. Abram Ioffe obtained the same result as Millikan. Millikan used charged microparticles of metals. Abram Ioffe published his results in 1913.",
  "Niels Bohr postulated electrons resided in quantized energy states determined by angular momentum of electron's orbit about nucleus.",
  "Electrons can move between States, Orbits by Emission of Photons, Absorption of Photons. Photons have frequencies of Specific frequencies.",
  "Chemical bonds, explained by Gilbert Newton Lewis, are proposed by him in 1916 as covalent bonds, which are maintained by a pair of electrons shared between two atoms between them.",
  "He divided shells into cells contained pair of electrons.",
  "Langmuir's model was able to explain chemical properties of all elements in the periodic table, which largely repeat themselves according to periodic law.",
  "Wolfgang Pauli observed atom's shell-like structure in 1924.",
  "The prohibition known as Pauli exclusion principle occurs when more than one electron occupies the same quantum energy state.",
  "Dutch physicists Samuel Goudsmit and George Uhlenbeck provided a physical mechanism that explains a fourth parameter that had two distinct possible values.",
  "The intrinsic angular momentum became known as spin, which explained the previously mysterious splitting of spectral lines observed with a high-resolution spectrograph, known as fine structure splitting.",
  "Electrons and other matter show properties of particles and waves.",
  "Particle has corpuscular properties and demonstrates corpuscular properties, has localized position in space along its trajectory, and has position in space at any given moment.",
  "Light displays wave-like nature when a beam of light passes through parallel slits, creating interference patterns.",
  "Alexander Reid, Thomson's graduate student, performed first experiments but is rarely mentioned; he died in a motorcycle accident.",
  "The Wave equation could be used to predict the probability of finding an electron near a position, where the electron was bound in space and its wave equations did not change in time.",
  "The approach led to the formulation of quantum mechanics by Heisenberg in 1925, with solutions of Schrödinger's equation providing derivations of energy states of an electron in a hydrogen atom, equivalent to derivations by Bohr in 1913 known to reproduce the hydrogen spectrum.",
  "Dirac developed a model of vacuum as an infinite sea of particles with negative energy, which he dubbed the Dirac sea in 1930.",
  "Willis Lamb worked with Robert Retherford and found certain quantum states of the hydrogen atom, which should have the same energy but were shifted in relation to each other. The difference came to be called the Lamb shift.",
  "The small difference was called an anomalous magnetic dipole moment of electron.",
  "The Theory of quantum electrodynamics explained the difference, developed by Sin-Itiro Tomonaga, Julian Schwinger, and Richard Feynman in the late 1940s.",
  "The radiation was caused by acceleration of electrons through a magnetic field, where electrons moved near speed of light.",
  "The First high-energy particle collider was ADONE, which began operations in 1968 with a beam energy of 1.5 GeV.",
  "The device accelerated electrons and positrons, with electrons accelerated in one direction and positrons accelerated in the opposite direction. The collision involved both electrons and positrons, resulting in the energy doubling compared to striking a static target with an electron.",
  "The electron wavefunction spreads in a semiconductor lattice, interacts negligibly with valence band electrons, and can be treated in a single particle formalism, where the mass of the electron wavefunction is replaced by an effective mass tensor.",
  "Electrons have the lowest mass of any charged lepton and belong to the first-generation of fundamental particles.",
  "The second generation contains the muon and the tau, both of which are identical to the electron in charge, spin, and interactions, but are more massive than the electron.",
  "The members of the lepton group are fermions with half-odd integer spin. The electron has a spin of 1/2.",
  "The mass-energy equivalence corresponds to rest energy and has a value of 0.511 MeV or 8.19×10^-14 J.",
  "The Proton has a mass ratio to the Electron of about 1836.",
  "Electrons have an electric charge of -1.602176634×10^-19 coulombs, which is used as a standard unit of charge for subatomic particles and is also called the elementary charge.",
  "The electron is symbolized by e− and the positron is symbolized by e+",
  "The property is usually stated by referring to electron, which is a spin-1/2 particle.",
  "Particles have a spin magnitude of ℏ/2 and the result of measurement of projection of spin on any axis can only be ±ℏ/2.",
  "The electron has an intrinsic magnetic moment that is along its spin axis.",
  "The electron has no known substructure.",
  "Electrons split into three independent particles, namely spinon, orbiton, holon, and chargon.",
  "The Electron can be considered as a bound state of three. The Spinon carries the spin of the electron. The Orbiton carries the orbital degree of freedom. The Chargon carries charge. The Spinon behaves as an independent quasiparticle. The Orbiton behaves as an independent quasiparticle. The Chargon behaves as an independent quasiparticle.",
  "The Hypothesis of finite radius of electron is part of Admission, which is incompatible to the premises of the theory of relativity.",
  "The electron has a radius of zero, generates serious mathematical difficulties, which is due to the self-energy of the electron tending to infinity.",
  "The uncertainty relation can be used to derive the electron radius of 10^-18 meters.",
  "Elementary particles spontaneously decay into less massive particles.",
  "The Muon has a mean lifetime of 2.2×10⁻⁶ seconds and decays into Electron, Muon neutrino, and Electron antineutrino.",
  "The electron is thought to be stable on theoretical grounds and is the least massive particle with non-zero electric charge. Electron decay would violate charge conservation.",
  "The wave-particle duality is called this, which can be demonstrated using the double-slit experiment.",
  "The wave-like property of one particle can be described mathematically as a complex-valued function or as a wave function, commonly denoted by the Greek letter psi (ψ).",
  "Electrons are identical particles that cannot be distinguished by intrinsic physical properties.",
  "The wave function of fermions is antisymmetric and changes sign when two electrons are swapped, represented as Ψ(r1, r2) = -Ψ(r2, r1). The variables r1 and r2 represent the first and second electrons, respectively.",
  "The absolute value is not changed by sign swap, this corresponds to equal probabilities.",
  "Bosons have symmetric wave functions, such as the photon.",
  "The solutions of the wave equation for interacting electrons result in zero probability, and each pair will occupy the same location or state.",
  "This principle explains many of the properties of electrons.",
  "It causes groups of bound electrons to occupy different orbitals in an atom, rather than all overlapping each other in the same orbit.",
  "The photon spends time as a combination of virtual electron plus virtual positron, where the virtual electron rapidly annihilates the virtual positron.",
  "The combination of energy variation needed to create particles and the time during which particles exist both fall under the threshold of detectability expressed by Heisenberg uncertainty relation.",
  "Energy needed to create virtual particles, denoted as ΔE, can be borrowed from vacuum. Borrowed energy is borrowed for a period of time, Δt, where the product of borrowed energy and borrowed time is no more than the reduced Planck constant, which is approximately equal to 6.6×10^(-16) eV·s.",
  "This causes vacuum polarization.",
  "Vacuum behaves like a medium with dielectric permittivity more than unity.",
  "This polarization was confirmed experimentally in 1997 using Japanese TRISTAN particle accelerator.",
  "Virtual particles cause shielding effect that is comparable for mass of the electron.",
  "The interaction with virtual particles explains the deviation of intrinsic magnetic moment of the electron from Bohr magneton, which is about 0.1% and is a deviation of anomalous magnetic moment.",
  "The predicted difference agrees with the experimentally determined value, an agreement that is viewed as a great achievement, one of quantum electrodynamics.",
  "The electron has intrinsic angular momentum, magnetic moment, and the formation of virtual photons occurs in the electric field generated by the electron.",
  "Photons cause Electron to shift about in jittery fashion, which results in net circular motion with precession.",
  "Motion produces spin, magnetic moment, and is related to electrons.",
  "The creation of virtual photons explains the Lamb shift observed in spectral lines.",
  "Wavelength explains static of virtual particles around elementary particles and is at close distance.",
  "The strength of force is determined by Coulomb's inverse square law.",
  "Electron is in motion and generates magnetic field.",
  "This property of induction supplies magnetic field which drives electric motor.",
  "The electromagnetic field of an arbitrary moving charged particle is expressed by Liénard–Wiechert potentials, which are valid even when the particle's speed is close to that of light (relativistic).",
  "The electron is subject to Lorentz force, which acts perpendicularly to the plane defined by the magnetic field and electron velocity.",
  "The centripetal force causes the electron to follow a helical trajectory through the field with a radius called gyroradius.",
  "The acceleration induces electron to radiate energy in the form of synchrotron radiation.",
  "The energy emission causes recoil of the electron, which is known as Abraham-Lorentz-Dirac Force, creating friction that slows the electron.",
  "Force is caused by back-reaction of electron's own field upon itself.",
  "Photons mediate electromagnetic interactions between particles in quantum electrodynamics.",
  "An isolated electron cannot emit or absorb a real photon, as doing so would violate conservation of energy and conservation of momentum.",
  "Virtual photons can transfer momentum between two charged particles.",
  "The deceleration of an electron results in the emission of Bremsstrahlung radiation.",
  "The collision between a Photon and an Electron is an inelastic collision called Compton scattering.",
  "Collision results in transfer of momentum and energy between particles, which modifies the wavelength of a photon by an amount called Compton shift.",
  "The magnitude of wavelength shift has a maximum value of h/mec, which is known as the Compton wavelength.",
  "The interaction between light and free electrons is called Thomson scattering or linear Thomson scattering.",
  "The value is a dimensionless quantity formed by the ratio of two energies, where the two energies are electrostatic energy of attraction (or repulsion) at a separation of one Compton wavelength and the rest energy of the charge.",
  "\\u03b1 is given by 0.007297353 which is approximately equal to 1/137.",
  "Electron and positron have negligible momentum. Positronium atom can form before annihilation results in two or three gamma ray photons totalling 1.022 MeV.",
  "A high-energy photon can transform into an electron or a positron through a process called pair production, which requires the presence of a nearby charged particle, typically a nucleus.",
  "The left-handed component of an electron's wavefunction forms a weak isospin doublet with the electron neutrino.",
  "Electron neutrinos behave like electrons.",
  "A member of a doublet undergoes charged current interaction, emits or absorbs W, and is converted into the other member.",
  "The electron and electron neutrino can undergo neutral current interaction via Z0 exchange, which is responsible for neutrino-electron elastic scattering.",
  "The system, called Atom, has electrons bound to nucleus.",
  "The atom has electrons and nucleus, and is called ion.",
  "The bound electron has a wave-like behavior described by atomic orbital function.",
  "The Orbital has quantum numbers for energy, angular momentum, and projection of angular momentum, and exists around the nucleus.",
  "The Pauli exclusion principle states that each orbital can be occupied by up to two electrons, which requires electrons to differ in their spin quantum number.",
  "Electrons can transfer between different orbitals by emission or absorption of photons with an energy that matches the difference in potential.",
  "Other methods of orbital transfer include collisions with particles such as electrons and the Auger effect.",
  "Electrons have an orbital angular momentum of quantized.",
  "The electron is charged and produces an orbital magnetic moment, which is proportional to angular momentum.",
  "The net magnetic moment of an atom is equal to the vector sum of the orbital magnetic moments of all electrons and the nucleus, as well as the vector sum of the spin magnetic moments of all electrons and the nucleus.",
  "Electrons occupy the same orbital called paired electrons, which cancel each other out in terms of magnetic moments.",
  "The Chemical bond occurs between atoms and results from electromagnetic interactions, which are described by laws of quantum mechanics.",
  "The formation of molecules is allowed by sharing or transfer of electrons.",
  "molecular structures have existence of electron pairs as a fundamental factor",
  "Electrons have opposed spins and can occupy the same molecular orbital, which does not violate the Pauli exclusion principle and is similar to atoms.",
  "Molecular orbitals have different spatial distribution of electron density.",
  "Non-bonded pairs have electrons distributed in large volume around nuclei.",
  "The object is said to be negatively charged due to an excess of electrons.",
  "object has fewer electrons than number of protons in nuclei is said to be positively charged.",
  "The object is electrically neutral when the number of electrons is equal to the number of protons.",
  "A macroscopic body can develop electric charge through rubbing, which is caused by the triboelectric effect.",
  "Independent electrons moving in vacuum are termed free electrons.",
  "Electrons in metals behave as free particles.",
  "Particles termed as electrons in metals and other solids are quasi-electrons, which are quasiparticles with the same electrical charge, spin, and magnetic moment, and might have a different mass.",
  "Free electrons move, producing a net flow of charge called an electric current, which generates a magnetic field.",
  "The interactions are described by Maxwell's equations.",
  "The electrical conductivity of a material determines the value of electric current when electric potential is applied to the material.",
  "Electrons remain bound to their respective atoms, material behaves as insulator.",
  "Semiconductors have a variable level of conductivity lying between extremes of conduction and insulation.",
  "Metals have an electronic band structure that contains partially filled electronic bands.",
  "Such bands allows electrons in metals to behave as if they were free or delocalized electrons.",
  "Electrons move through material like free electrons.",
  "Collisions take place between electrons and atoms, and the drift velocity of electrons in a conductor is on the order of millimeters per second.",
  "A change of current at one point in the material causes changes in currents in other parts of the material with a propagation velocity typically about 75% of light speed.",
  "Electrical signals propagate as waves with velocity dependent on the dielectric constant of the material.",
  "Metals make good conductors of heat and are relatively good conductors of heat. Delocalized electrons are free to transport thermal energy between atoms and transport thermal energy between atoms.",
  "The thermal conductivity of a metal is nearly independent of temperature.",
  "The Wiedemann–Franz law, expressed mathematically by This, states that the ratio of thermal conductivity to electrical conductivity is proportional to temperature.",
  "Materials can undergo phase transition, lose all resistivity to electric current, undergo superconductivity, and are cooled below critical temperature.",
  "Pairs of electrons are called Cooper pairs, which have motion that is coupled to lattice vibrations known as phonons. This motion avoids collisions with atoms, as collisions with atoms create electrical resistance.",
  "Electrons inside conducting solids behave as quasi-particles themselves and, when tightly confined at temperatures close to absolute zero, behave as though they had split into three other quasiparticles: spinons, orbitons and holons.",
  "The observer's point of view sees the electron's relativistic mass increasing as its speed approaches the speed of light, making it more and more difficult to accelerate the electron from within the observer's frame of reference.",
  "The electron behaves as a wave with a characteristic de Broglie wavelength, and has a velocity given as the given velocity.",
  "The wavelength is given by Planck constant divided by momentum.",
  "The 51 GeV electron has a wavelength of 2.4x10^-17 m, which is small enough to explore structures below the size of an atomic nucleus.",
  "The annihilation process had an excess in number, which was particles over antiparticles, and the reasons remain uncertain.",
  "The electron survived one billion electron-positron pairs produced one electron.",
  "The excess of matched protons over antiprotons is known as baryon asymmetry which results in a net charge of zero for the universe.",
  "Protons and neutrons began to participate in reactions with each other, a process known as nucleosynthesis, forming isotopes of hydrogen and helium, as well as trace amounts of lithium.",
  "The process peaked after five minutes.",
  "What followed is a period known as recombination, during which neutral atoms were formed in an expanding universe, making it transparent to radiation.",
  "Antimatter particles annihilate with electrons and release gamma rays.",
  "Stellar evolution results in synthesis of radioactive isotopes.",
  "Selected isotopes can undergo negative beta decay which emits an electron and an antineutrino from the nucleus.",
  "The other member of the pair is given negative energy results in net loss of mass-energy by the black hole.",
  "The rate of Hawking radiation increases with decreasing mass, causing the black hole to evaporate away until finally explodes.",
  "More than half of cosmic radiation consists of muons observed from Earth's surface.",
  "Free electrons form plasma, which radiates energy due to Bremsstrahlung radiation and is in the corona of a star.",
  "Electron gas can undergo plasma oscillation, which is waves caused by synchronized variations in electron density, producing energy emissions that can be detected by using radio telescopes.",
  "The Photon has a frequency proportional to its energy.",
  "A bound electron transitions between different energy levels of an atom by absorbing or emitting photons with characteristic frequencies.",
  "Atoms are irradiated by a source with broad spectrum, distinct dark lines appear in the spectrum of transmitted radiation, corresponding frequency is absorbed by atom's electrons.",
  "Spectroscopic measurements allow the composition and physical properties of a substance to be determined, detection, determine the composition and physical properties of a substance, and detect the strength and width of lines.",
  "Electrons interact with particle detectors, which allow measurement of specific properties such as energy, spin, and charge.",
  "This enables precise measurements of the particle properties.",
  "Scientists used Attosecond pulses, called short flashes of light, allowed Electron's motion to be observed for the first time.",
  "Electrons are distributed in solid materials. Angle-resolved photoemission spectroscopy can visualize distribution of electrons.",
  "The Technique employs the Photoelectric effect and measures Reciprocal space, which is a mathematical representation of periodic structures used to infer the Original structure.",
  "They allow energy densities up to 10^7 W·cm^-2 across a narrow focus diameter of 0.1–1.3 mm and usually require no filler material.",
  "The welding technique must be performed in a vacuum, which prevents electrons from interacting with gas before reaching the target. This technique can be used to join conductive materials that would otherwise be considered unsuitable for welding.",
  "Electron-beam lithography is a method of etching semiconductors and achieves resolutions smaller than a micrometer.",
  "The technique is limited by high costs, slow performance, the need to operate the beam in the vacuum, and the tendency of the electrons to scatter in solids.",
  "The last problem limits resolution to 10 nm.",
  "The EBL is primarily used for production of small numbers of specialized integrated circuits.",
  "Electron beam processing is used to irradiate materials, change physical properties of materials, sterilize medical products, and sterilize food products.",
  "Intensive electron radiation causes many orders of magnitude decrease of viscosity and stepwise decrease of activation energy.",
  "Linear particle accelerators generate electron beams that are used for treatment of superficial tumors in radiation therapy.",
  "Electron therapy can treat skin lesions such as basal-cell carcinomas. Electron beams penetrate to limited depth and are absorbed at up to 5 cm. Electron energies are in the range of 5–20 MeV.",
  "Particles emit Synchrotron radiation as they pass through magnetic fields.",
  "The intensity of radiation depends on spin polarization, which polarizes the electron beam in a process known as the Sokolov-Ternov effect.",
  "Electron and positron beams are collided upon particles' accelerating to the required energies, particle detectors observe resulting energy emissions, and particle physics studies resulting energy emissions.",
  "Low-energy electron diffraction is a method of bombarding a crystalline material with a collimated beam of electrons, observes resulting diffraction patterns, which determine the structure of the material.",
  "The RHEED technique uses reflection of beam of electrons fired at various low angles, which characterizes the surface of crystalline materials.",
  "The beam energy is typically in the range 8-20 keV, and the angle of incidence is 1-4°.",
  "The electron microscope directs a focused beam of electrons at the specimen.",
  "Electrons change their properties such as movement direction, angle, relative phase, and energy when a beam interacts with a material.",
  "Electron microscopes are limited by the de Broglie wavelength of electron.",
  "This wavelength is equal to 0.0037 nm. Electrons are accelerated across a 100,000-volt potential.",
  "The capability of electron microscope makes it a laboratory instrument that is useful for high resolution imaging.",
  "Transmission electron microscopes function like overhead projectors, where a beam of electrons passes through a slice of material, is projected by lenses, and is projected on a photographic slide or charge-coupled device.",
  "Magnifications range from 100× to 1,000,000× or higher for microscope types.",
  "Electrons emit synchrotron radiation which coherently interacts with electrons, strongly amplifying the radiation field at resonance frequency.",
  "Devices are used in manufacturing, communication, and medical applications. Medical applications include soft tissue surgery.",
  "Electrons are important in cathode-ray tubes, which have been extensively used as display devices in laboratory instruments, computer monitors and television sets.",
  "Every photon striking photocathode initiates avalanche of electrons which produces detectable current pulse."
]